## Staging: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.lambda_dynamodb will be updated in-place
  ~ resource "aws_iam_policy" "lambda_dynamodb" {
        id          = "arn:aws:iam::687401027353:policy/lambda_dynamobdb"
        name        = "lambda_dynamobdb"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            # (3 unchanged elements hidden)
                            "dynamodb:PutItem",
                          + "dynamodb:GetShardIterator",
                          + "dynamodb:GetRecords",
                            "dynamodb:GetItem",
                          + "dynamodb:DescribeStream",
                            "dynamodb:DeleteItem",
                            # (1 unchanged element hidden)
                        ]
                      ~ Resource = [
                            # (2 unchanged elements hidden)
                            "arn:aws:dynamodb:ca-central-1:687401027353:table/ReliabilityQueue",
                          + "",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags        = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.vault_updated_item_stream will be created
  + resource "aws_lambda_event_source_mapping" "vault_updated_item_stream" {
      + batch_size                    = 25
      + enabled                       = true
      + function_arn                  = (known after apply)
      + function_name                 = "arn:aws:lambda:ca-central-1:687401027353:function:Archiver"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = 3
      + parallelization_factor        = (known after apply)
      + starting_position             = "LATEST"
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)

      + filter_criteria {
          + filter {
              + pattern = jsonencode(
                    {
                      + dynamodb = {
                          + NewImage = {
                              + Retrieved = {
                                  + N = [
                                      + "1",
                                    ]
                                }
                            }
                        }
                    }
                )
            }
        }
    }

  # aws_lambda_function.archiver will be updated in-place
  ~ resource "aws_lambda_function" "archiver" {
        id                             = "Archiver"
      ~ last_modified                  = "2022-01-18T19:33:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "iK0DwnufSvkYm9HthTr+kB+J/eL07aEIoje4wYULQ+4=" -> "OoSD82l6l4Q91tI2StT0HN05FX2Otdv5h2H1NSxULvk="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DYNAMODB_VAULT_INDEX_NAME" = "retrieved-index" -> null
                # (4 unchanged elements hidden)
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]

9 tests, 8 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
